Конфигурация/InformationRegisters/ФормулыРасчетаСтавокКупонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФормулыРасчетаСтавокКупонов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФормулаРасчетаСтавки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиРасчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Облигация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерКупона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ФормулыРасчетаСтавокКупонов/Forms/ФормаГрупповогоЗаполнения/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЭтаФорма.Период		= '19800101';
	ЭтаФорма.Действует	= Истина;
	
	Если Параметры.Свойство("Купоны") Тогда
		Для Каждого ОписаниеКупона Из Параметры.Купоны Цикл
			СтрокаКупона = ЭтаФорма.Купоны.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаКупона, ОписаниеКупона);
			СтрокаКупона.Отметка = Истина;
		КонецЦикла;
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)

	Для Каждого ОписаниеКупона Из Купоны Цикл
		
		Если ОписаниеКупона.Отметка Тогда
			
			ИндексСтроки = Купоны.Индекс(ОписаниеКупона);
			НомерСтроки	 = Формат(ИндексСтроки + 1, "ЧГ=");
			ПутьКСтроке	 = СтрШаблон("Купоны[%1]", Формат(ИндексСтроки, "ЧГ="));
			
			Если Не ЗначениеЗаполнено(ОписаниеКупона.Облигация) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Поле ""Облигация"" в строке %1 не заполнено.", НомерСтроки), , ПутьКСтроке + ".Облигация", , Отказ);	
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ОписаниеКупона.НомерКупона) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Поле ""Номер купона"" в строке %1 не заполнено.", НомерСтроки), , ПутьКСтроке + ".НомерКупона", , Отказ);	
			КонецЕсли;			
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействуетПриИзменении(Элемент)
	
	Если Не ЭтаФорма.Действует Тогда
		ЭтаФорма.ФормулаРасчетаСтавки = Неопределено;
	КонецЕсли;
	
	НастроитьВидимостьДоступность(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаУстановитьВсеФлажки(Команда)
	
	ИзменитьВсеФлажки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСнятьВсеФлажки(Команда)
	
	ИзменитьВсеФлажки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнитьФормулы(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновленныеКупоны = ЗаполнитьФормулы();
	
	Если ОбновленныеКупоны <> Неопределено Тогда
		ЭтаФорма.Закрыть(ОбновленныеКупоны);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьДоступность(Форма)

	Элементы = Форма.Элементы;
	
	Элементы.ФормулаРасчетаСтавки.Доступность = Форма.Действует;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВсеФлажки(Отметка)

	Для Каждого Элемент Из ЭтаФорма.Купоны Цикл
		Элемент.Отметка = Отметка;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ЗаполнитьФормулы()
	
	ОбновленныеКупоны = Новый Массив;
	
	НачатьТранзакцию();	
	
	Для Каждого ОписаниеКупона Из Купоны Цикл
		
		Если ОписаниеКупона.Отметка Тогда
			
			МенеджерЗаписи = РегистрыСведений.ФормулыРасчетаСтавокКупонов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период				= ЭтаФорма.Период;
			МенеджерЗаписи.Облигация			= ОписаниеКупона.Облигация;
			МенеджерЗаписи.НомерКупона			= ОписаниеКупона.НомерКупона;
			МенеджерЗаписи.ФормулаРасчетаСтавки	= ЭтаФорма.ФормулаРасчетаСтавки;
			МенеджерЗаписи.Действует			= ЭтаФорма.Действует;
			
			Попытка
				МенеджерЗаписи.Записать(Истина);				
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
				Возврат Неопределено;
			КонецПопытки;
			
			ОбновленныеКупоны.Добавить(Новый Структура("Облигация, НомерКупона", МенеджерЗаписи.Облигация, МенеджерЗаписи.НомерКупона));
			
		КонецЕсли;
		
	КонецЦикла;

	ЗафиксироватьТранзакцию();
	
	Возврат ОбновленныеКупоны;	
	
КонецФункции
